LINE_VARIANTS = {
    "Сокольническая": [
        "Сокольническая", "Сокольническ", "Сокольнич", "Сокльническая", "Соколническая", 
        "Сокольничск", "Сокольничка", "Соклническая", "Сокольнически", "Сокльническ",
        "Сокльнически", "Соколническ", "Соколнич", "Сокольнческая", "Сокольничесая",
        "Соклническ", "Сокольничская", "Соклнич", "Сокльнич", "Сокольни"
    ],
    "Замоскворецкая": [
        "Замоскворецкая", "Замоскворецк", "Замоскворцкая", "Замскворецкая", "Замоскворецая",
        "Замосквор", "Замскворецк", "Замскворцкая", "Замоскв", "Замсквор",
        "Замоскврецкая", "Замоскворетская", "Замскворец", "Замоскворц", "Замоск",
        "Замоскворцк", "Замскв", "Замоскворцкя", "Замосквр", "Замоскорецкая"
    ],
    "Каховская": [
        "Каховская", "Каховск", "Каховка", "Кахвская", "Кахвск",
        "Кахв", "Ках", "Кахов", "Каховая", "Каховскя",
        "Каховкая", "Кахвка", "Каховсая", "Каховк", "Кахофская",
        "Кахофск", "Кахоф", "Кахо", "Кахофс", "Кахоская"
    ],
    "Арбатско-Покровская": [
        "Арбатско-Покровская", "Арбатско-Покровск", "Арбатско-Покров", "Арбатска-Покровская", "Арбатска-Покровск",
        "Арбатско-Покр", "Арбатско-Пок", "Арбатск-Покров", "Арбатск-Покр", "Арбатско-Покрвская",
        "Арбат-Покровская", "Арбат-Покровск", "Арбатско-Покровка", "Арбатск-Покровка", "Арбатско-Проковская",
        "Арбатско-Проковск", "Арбатск-Проков", "Арбатс-Покровская", "Арбатс-Покровск", "Арбатско-Покровскя"
    ],
    "Филевская": [
        "Филевская", "Филевск", "Филевс", "Филвская", "Филвск",
        "Филвс", "Филефская", "Филефск", "Филефс", "Филеевская",
        "Филев", "Филевая", "Филивская", "Филивск", "Филивс",
        "Флевская", "Флевск", "Флевс", "Филевскя", "Филевска", "Филёвская",
    ],
    "Кольцевая": [
        "Кольцевая", "Кольцев", "Кольцвая", "Колцевая", "Колцев",
        "Кольц", "Колц", "Кольцевя", "Кольцв", "Колцевя",
        "Кольцеая", "Кольцая", "Колцеая", "Колцая", "Клцевая",
        "Клцев", "Кльцевая", "Кльцев", "Кольцвя", "Кльц"
    ],
    "Люблинская": [
        "Люблинская", "Люблинск", "Люблинс", "Люблин", "Люблнская", 
        "Люблнск", "Люблнс", "Люблн", "Люблинка", "Люблинчка",
        "Люблинцкая", "Люблинц", "Люблинкая", "Люблнка", "Люблнцкая", 
        "Люблинско", "Люблинцко", "Люблнско", "Лблинская", "Люблинч"
    ],
    "Серпухово-Тимирязевская": [
        "Серпухово-Тимирязевская", "Серпухово-Тимиряз", "Серпухов-Тимирязевская", "Серпух-Тимирязевская", "Серпух-Тимиряз",
        "Серпух-Тимир", "Серпухово-Тмирязевская", "Серпухово-Тмиряз", "Серпух-Тмирязевская", "Серпух-Тмиряз",
        "Серпухов-Тимир", "Серп-Тимирязевская", "Серп-Тимиряз", "Серп-Тимир", "Серпухво-Тимирязевская",
        "Серпухв-Тимиряз", "Серпухово-Тимиря", "Серпухово-Тимряз", "Серпух-Тимряз", "Серп-Тимирязев"
    ],
    "Бутовская линия": [
        "Бутовская линия", "Бутовская лин", "Бутовска линия", "Бутов линия", "Бутовска лин",
        "Бутов лин", "Бутовская лн", "Бутовска лн", "Бутов лн", "Бутовская ли",
        "Бутовска ли", "Бутов ли", "Бутовская линя", "Бутовска линя", "Бутов линя",
        "Бутовск линия", "Бутовск лин", "Бутовск лн", "Бутовск ли", "Бутовск линя"
    ],
    "Солнцевская линия": [
        "Солнцевская линия", "Солнцевская лин", "Солнцевска линия", "Солнцевска лин", "Солнц линия",
        "Солнц лин", "Солнцевская лн", "Солнцевска лн", "Солнцевска ли", "Солнцевска ли",
        "Солнцевска линя", "Солнцевска линя", "Солнц линя", "Солнцевая линия", "Солнцевая лин",
        "Солнцевая лн", "Солнцевая ли", "Солнцевая линя", "Солнцевка линия", "Солнцевка лин"
    ],
    "Некрасовская": [
        "Некрасовская", "Некрасовск", "Некрасовс", "Некрасов", "Некраская",
        "Некраск", "Некрас", "Некра", "Некрасовка", "Некрасовчка",
        "Некрсовская", "Некрсовск", "Некрсовс", "Некрсов", "Некрская",
        "Некрска", "Некрс", "Некрка", "Некрасовцкая", "Некрасовцк"
    ],
    "Большая кольцевая линия (БКЛ)": [
        "Большая кольцевая линия", "Большая кольцевая лин", "Большая кольцевая лн", "Большая кольцевая ли", "Большая кольц лн",
        "Большая кольц ли", "Большая кольц лин", "БКЛ", "Большая кольц линия", "Большая колцевая линия",
        "Большая колцевая лин", "Большая колцевая лн", "Большая колцевая ли", "Большая колц лн", "Большая колц ли",
        "Большая колц лин", "Большая колцевая линя", "Большая колц линя", "Большая колцев линия", "Большая колцев лин"
    ]
}
